# FInSymDef

## Description
Function FInSymDef returns a handle to the first component object within the referenced symbol definition.

```pascal
FUNCTION FInSymDef(sdHd : HANDLE): HANDLE;
```

```python
def vs.FInSymDef(sdHd):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sdHd|HANDLE|Handle to symbol definition.|

## Version
Availability: from All Versions

## Category
* Document List Handling